Revit 2027 API
BuiltInFailures.SiteFailures.PointNotInSurface Property
 A Point is outside of the Surface boundary. Insert the Point on the boundary instead, and then drag it to the desired location.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PointNotInSurface { get; }
Public Shared ReadOnly Property PointNotInSurface As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PointNotInSurface {
	FailureDefinitionId^ get ();
}
static member PointNotInSurface : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SiteFailures Class
Autodesk.Revit.DB Namespace